MikroElektronika/core_packages/PIC/XC8/def/PIC18F47Q10/mcu.h
extern volatile CKPPSbits_t CKPPSbits __at(0xEB1);
// bitfield macros
#define _CKPPS_PIN_POSN                                     0x0
#define _CKPPS_PIN_POSITION                                 0x0
#define _CKPPS_PIN_SIZE                                     0x3
#define _CKPPS_PIN_LENGTH                                   0x3
#define _CKPPS_PIN_MASK                                     0x7
#define _CKPPS_PORT_POSN                                    0x3
#define _CKPPS_PORT_POSITION                                0x3
#define _CKPPS_PORT_SIZE                                    0x2
#define _CKPPS_PORT_LENGTH                                  0x2
#define _CKPPS_PORT_MASK                                    0x18
#define _CKPPS_TXPPS0_POSN                                  0x0
#define _CKPPS_TXPPS0_POSITION                              0x0
#define _CKPPS_TXPPS0_SIZE                                  0x1
#define _CKPPS_TXPPS0_LENGTH                                0x1
#define _CKPPS_TXPPS0_MASK                                  0x1
#define _CKPPS_TXPPS1_POSN                                  0x1
#define _CKPPS_TXPPS1_POSITION                              0x1
#define _CKPPS_TXPPS1_SIZE                                  0x1
#define _CKPPS_TXPPS1_LENGTH                                0x1
#define _CKPPS_TXPPS1_MASK                                  0x2
#define _CKPPS_TXPPS2_POSN                                  0x2
#define _CKPPS_TXPPS2_POSITION                              0x2
#define _CKPPS_TXPPS2_SIZE                                  0x1
#define _CKPPS_TXPPS2_LENGTH                                0x1
#define _CKPPS_TXPPS2_MASK                                  0x4
#define _CKPPS_TXPPS3_POSN                                  0x3
#define _CKPPS_TXPPS3_POSITION                              0x3
#define _CKPPS_TXPPS3_SIZE                                  0x1
#define _CKPPS_TXPPS3_LENGTH                                0x1
#define _CKPPS_TXPPS3_MASK                                  0x8
#define _CKPPS_TXPPS4_POSN                                  0x4
#define _CKPPS_TXPPS4_POSITION                              0x4
#define _CKPPS_TXPPS4_SIZE                                  0x1
#define _CKPPS_TXPPS4_LENGTH                                0x1
#define _CKPPS_TXPPS4_MASK                                  0x10
#define _CKPPS_TXPPS_POSN                                   0x0
#define _CKPPS_TXPPS_POSITION                               0x0
#define _CKPPS_TXPPS_SIZE                                   0x5
#define _CKPPS_TXPPS_LENGTH                                 0x5
#define _CKPPS_TXPPS_MASK                                   0x1F
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned TXPPS0                 :1;
        unsigned TXPPS1                 :1;
        unsigned TXPPS2                 :1;
        unsigned TXPPS3                 :1;
        unsigned TXPPS4                 :1;
    };
    struct {
        unsigned TXPPS                  :5;
    };
} TX1PPSbits_t;
extern volatile TX1PPSbits_t TX1PPSbits __at(0xEB1);
// bitfield macros
#define _TX1PPS_PIN_POSN                                    0x0
#define _TX1PPS_PIN_POSITION                                0x0
#define _TX1PPS_PIN_SIZE                                    0x3
#define _TX1PPS_PIN_LENGTH                                  0x3
#define _TX1PPS_PIN_MASK                                    0x7
#define _TX1PPS_PORT_POSN                                   0x3
#define _TX1PPS_PORT_POSITION                               0x3
#define _TX1PPS_PORT_SIZE                                   0x2
#define _TX1PPS_PORT_LENGTH                                 0x2
#define _TX1PPS_PORT_MASK                                   0x18
#define _TX1PPS_TXPPS0_POSN                                 0x0
#define _TX1PPS_TXPPS0_POSITION                             0x0
#define _TX1PPS_TXPPS0_SIZE                                 0x1
#define _TX1PPS_TXPPS0_LENGTH                               0x1
#define _TX1PPS_TXPPS0_MASK                                 0x1
#define _TX1PPS_TXPPS1_POSN                                 0x1
#define _TX1PPS_TXPPS1_POSITION                             0x1
#define _TX1PPS_TXPPS1_SIZE                                 0x1
#define _TX1PPS_TXPPS1_LENGTH                               0x1
#define _TX1PPS_TXPPS1_MASK                                 0x2
#define _TX1PPS_TXPPS2_POSN                                 0x2
#define _TX1PPS_TXPPS2_POSITION                             0x2
#define _TX1PPS_TXPPS2_SIZE                                 0x1
#define _TX1PPS_TXPPS2_LENGTH                               0x1
#define _TX1PPS_TXPPS2_MASK                                 0x4
#define _TX1PPS_TXPPS3_POSN                                 0x3
#define _TX1PPS_TXPPS3_POSITION                             0x3
#define _TX1PPS_TXPPS3_SIZE                                 0x1
#define _TX1PPS_TXPPS3_LENGTH                               0x1
#define _TX1PPS_TXPPS3_MASK                                 0x8
#define _TX1PPS_TXPPS4_POSN                                 0x4
#define _TX1PPS_TXPPS4_POSITION                             0x4
#define _TX1PPS_TXPPS4_SIZE                                 0x1
#define _TX1PPS_TXPPS4_LENGTH                               0x1
#define _TX1PPS_TXPPS4_MASK                                 0x10
#define _TX1PPS_TXPPS_POSN                                  0x0
#define _TX1PPS_TXPPS_POSITION                              0x0
#define _TX1PPS_TXPPS_SIZE                                  0x5
#define _TX1PPS_TXPPS_LENGTH                                0x5
#define _TX1PPS_TXPPS_MASK                                  0x1F
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned TXPPS0                 :1;
        unsigned TXPPS1                 :1;
        unsigned TXPPS2                 :1;
        unsigned TXPPS3                 :1;
        unsigned TXPPS4                 :1;
    };
    struct {
        unsigned TXPPS                  :5;
    };
} TXCK1PPSbits_t;
extern volatile TXCK1PPSbits_t TXCK1PPSbits __at(0xEB1);
// bitfield macros
#define _TXCK1PPS_PIN_POSN                                  0x0
#define _TXCK1PPS_PIN_POSITION                              0x0
#define _TXCK1PPS_PIN_SIZE                                  0x3
#define _TXCK1PPS_PIN_LENGTH                                0x3
#define _TXCK1PPS_PIN_MASK                                  0x7
#define _TXCK1PPS_PORT_POSN                                 0x3
#define _TXCK1PPS_PORT_POSITION                             0x3
#define _TXCK1PPS_PORT_SIZE                                 0x2
#define _TXCK1PPS_PORT_LENGTH                               0x2
#define _TXCK1PPS_PORT_MASK                                 0x18
#define _TXCK1PPS_TXPPS0_POSN                               0x0
#define _TXCK1PPS_TXPPS0_POSITION                           0x0
#define _TXCK1PPS_TXPPS0_SIZE                               0x1
#define _TXCK1PPS_TXPPS0_LENGTH                             0x1
#define _TXCK1PPS_TXPPS0_MASK                               0x1
#define _TXCK1PPS_TXPPS1_POSN                               0x1
#define _TXCK1PPS_TXPPS1_POSITION                           0x1
#define _TXCK1PPS_TXPPS1_SIZE                               0x1
#define _TXCK1PPS_TXPPS1_LENGTH                             0x1
#define _TXCK1PPS_TXPPS1_MASK                               0x2
#define _TXCK1PPS_TXPPS2_POSN                               0x2
#define _TXCK1PPS_TXPPS2_POSITION                           0x2
#define _TXCK1PPS_TXPPS2_SIZE                               0x1
#define _TXCK1PPS_TXPPS2_LENGTH                             0x1
#define _TXCK1PPS_TXPPS2_MASK                               0x4
#define _TXCK1PPS_TXPPS3_POSN                               0x3
#define _TXCK1PPS_TXPPS3_POSITION                           0x3
#define _TXCK1PPS_TXPPS3_SIZE                               0x1
#define _TXCK1PPS_TXPPS3_LENGTH                             0x1
#define _TXCK1PPS_TXPPS3_MASK                               0x8
#define _TXCK1PPS_TXPPS4_POSN                               0x4
#define _TXCK1PPS_TXPPS4_POSITION                           0x4
#define _TXCK1PPS_TXPPS4_SIZE                               0x1
#define _TXCK1PPS_TXPPS4_LENGTH                             0x1
#define _TXCK1PPS_TXPPS4_MASK                               0x10
#define _TXCK1PPS_TXPPS_POSN                                0x0
#define _TXCK1PPS_TXPPS_POSITION                            0x0
#define _TXCK1PPS_TXPPS_SIZE                                0x5
#define _TXCK1PPS_TXPPS_LENGTH                              0x5
#define _TXCK1PPS_TXPPS_MASK                                0x1F

