MikroElektronika/core_packages/PIC/XC8/def/PIC18F47Q10/mcu.h
extern volatile ADREFbits_t ADREFbits __at(0xF53);
// bitfield macros
#define _ADREF_ADPREF_POSN                                  0x0
#define _ADREF_ADPREF_POSITION                              0x0
#define _ADREF_ADPREF_SIZE                                  0x2
#define _ADREF_ADPREF_LENGTH                                0x2
#define _ADREF_ADPREF_MASK                                  0x3
#define _ADREF_ADNREF_POSN                                  0x4
#define _ADREF_ADNREF_POSITION                              0x4
#define _ADREF_ADNREF_SIZE                                  0x1
#define _ADREF_ADNREF_LENGTH                                0x1
#define _ADREF_ADNREF_MASK                                  0x10
#define _ADREF_ADPREF0_POSN                                 0x0
#define _ADREF_ADPREF0_POSITION                             0x0
#define _ADREF_ADPREF0_SIZE                                 0x1
#define _ADREF_ADPREF0_LENGTH                               0x1
#define _ADREF_ADPREF0_MASK                                 0x1
#define _ADREF_ADPREF1_POSN                                 0x1
#define _ADREF_ADPREF1_POSITION                             0x1
#define _ADREF_ADPREF1_SIZE                                 0x1
#define _ADREF_ADPREF1_LENGTH                               0x1
#define _ADREF_ADPREF1_MASK                                 0x2

// Register: ADCON1
#define ADCON1 ADCON1
extern volatile unsigned char           ADCON1              __at(0xF54);
#ifndef _LIB_BUILD
asm("ADCON1 equ 0F54h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADDSEN                 :1;
        unsigned                        :4;
        unsigned ADGPOL                 :1;
        unsigned ADIPEN                 :1;
        unsigned ADPPOL                 :1;
    };
} ADCON1bits_t;
extern volatile ADCON1bits_t ADCON1bits __at(0xF54);
// bitfield macros
#define _ADCON1_ADDSEN_POSN                                 0x0
#define _ADCON1_ADDSEN_POSITION                             0x0
#define _ADCON1_ADDSEN_SIZE                                 0x1
#define _ADCON1_ADDSEN_LENGTH                               0x1
#define _ADCON1_ADDSEN_MASK                                 0x1
#define _ADCON1_ADGPOL_POSN                                 0x5
#define _ADCON1_ADGPOL_POSITION                             0x5
#define _ADCON1_ADGPOL_SIZE                                 0x1
#define _ADCON1_ADGPOL_LENGTH                               0x1
#define _ADCON1_ADGPOL_MASK                                 0x20
#define _ADCON1_ADIPEN_POSN                                 0x6
#define _ADCON1_ADIPEN_POSITION                             0x6
#define _ADCON1_ADIPEN_SIZE                                 0x1
#define _ADCON1_ADIPEN_LENGTH                               0x1
#define _ADCON1_ADIPEN_MASK                                 0x40
#define _ADCON1_ADPPOL_POSN                                 0x7
#define _ADCON1_ADPPOL_POSITION                             0x7
#define _ADCON1_ADPPOL_SIZE                                 0x1
#define _ADCON1_ADPPOL_LENGTH                               0x1
#define _ADCON1_ADPPOL_MASK                                 0x80

// Register: ADCON2
#define ADCON2 ADCON2
extern volatile unsigned char           ADCON2              __at(0xF55);
#ifndef _LIB_BUILD
asm("ADCON2 equ 0F55h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADMD                   :3;
        unsigned ADACLR                 :1;
        unsigned ADCRS                  :3;
        unsigned ADPSIS                 :1;
    };
    struct {
        unsigned ADMD0                  :1;
        unsigned ADMD1                  :1;
        unsigned ADMD2                  :1;
        unsigned                        :1;
        unsigned ADCRS0                 :1;
        unsigned ADCRS1                 :1;
        unsigned ADCRS2                 :1;
    };
} ADCON2bits_t;
extern volatile ADCON2bits_t ADCON2bits __at(0xF55);
// bitfield macros
#define _ADCON2_ADMD_POSN                                   0x0
#define _ADCON2_ADMD_POSITION                               0x0
#define _ADCON2_ADMD_SIZE                                   0x3
#define _ADCON2_ADMD_LENGTH                                 0x3
#define _ADCON2_ADMD_MASK                                   0x7
#define _ADCON2_ADACLR_POSN                                 0x3
#define _ADCON2_ADACLR_POSITION                             0x3
#define _ADCON2_ADACLR_SIZE                                 0x1
#define _ADCON2_ADACLR_LENGTH                               0x1
#define _ADCON2_ADACLR_MASK                                 0x8
#define _ADCON2_ADCRS_POSN                                  0x4
#define _ADCON2_ADCRS_POSITION                              0x4
#define _ADCON2_ADCRS_SIZE                                  0x3
#define _ADCON2_ADCRS_LENGTH                                0x3
#define _ADCON2_ADCRS_MASK                                  0x70
#define _ADCON2_ADPSIS_POSN                                 0x7
#define _ADCON2_ADPSIS_POSITION                             0x7
#define _ADCON2_ADPSIS_SIZE                                 0x1
#define _ADCON2_ADPSIS_LENGTH                               0x1
#define _ADCON2_ADPSIS_MASK                                 0x80
#define _ADCON2_ADMD0_POSN                                  0x0
#define _ADCON2_ADMD0_POSITION                              0x0
#define _ADCON2_ADMD0_SIZE                                  0x1
#define _ADCON2_ADMD0_LENGTH                                0x1
#define _ADCON2_ADMD0_MASK                                  0x1
#define _ADCON2_ADMD1_POSN                                  0x1
#define _ADCON2_ADMD1_POSITION                              0x1
#define _ADCON2_ADMD1_SIZE                                  0x1
#define _ADCON2_ADMD1_LENGTH                                0x1
#define _ADCON2_ADMD1_MASK                                  0x2
#define _ADCON2_ADMD2_POSN                                  0x2
#define _ADCON2_ADMD2_POSITION                              0x2
#define _ADCON2_ADMD2_SIZE                                  0x1
#define _ADCON2_ADMD2_LENGTH                                0x1
#define _ADCON2_ADMD2_MASK                                  0x4
#define _ADCON2_ADCRS0_POSN                                 0x4
#define _ADCON2_ADCRS0_POSITION                             0x4
#define _ADCON2_ADCRS0_SIZE                                 0x1
#define _ADCON2_ADCRS0_LENGTH                               0x1
#define _ADCON2_ADCRS0_MASK                                 0x10
#define _ADCON2_ADCRS1_POSN                                 0x5
#define _ADCON2_ADCRS1_POSITION                             0x5
#define _ADCON2_ADCRS1_SIZE                                 0x1
#define _ADCON2_ADCRS1_LENGTH                               0x1
#define _ADCON2_ADCRS1_MASK                                 0x20
#define _ADCON2_ADCRS2_POSN                                 0x6
#define _ADCON2_ADCRS2_POSITION                             0x6
#define _ADCON2_ADCRS2_SIZE                                 0x1
#define _ADCON2_ADCRS2_LENGTH                               0x1
#define _ADCON2_ADCRS2_MASK                                 0x40

// Register: ADCON3
#define ADCON3 ADCON3
extern volatile unsigned char           ADCON3              __at(0xF56);
#ifndef _LIB_BUILD
asm("ADCON3 equ 0F56h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADTMD                  :3;
        unsigned ADSOI                  :1;
        unsigned ADCALC                 :3;
    };
    struct {
        unsigned ADTMD0                 :1;
        unsigned ADTMD1                 :1;
        unsigned ADTMD2                 :1;
        unsigned                        :1;
        unsigned ADCALC0                :1;
        unsigned ADCALC1                :1;
        unsigned ADCALC2                :1;
    };
} ADCON3bits_t;
extern volatile ADCON3bits_t ADCON3bits __at(0xF56);
// bitfield macros
#define _ADCON3_ADTMD_POSN                                  0x0
#define _ADCON3_ADTMD_POSITION                              0x0
#define _ADCON3_ADTMD_SIZE                                  0x3
#define _ADCON3_ADTMD_LENGTH                                0x3
#define _ADCON3_ADTMD_MASK                                  0x7
#define _ADCON3_ADSOI_POSN                                  0x3
#define _ADCON3_ADSOI_POSITION                              0x3
#define _ADCON3_ADSOI_SIZE                                  0x1
#define _ADCON3_ADSOI_LENGTH                                0x1
#define _ADCON3_ADSOI_MASK                                  0x8
#define _ADCON3_ADCALC_POSN                                 0x4
#define _ADCON3_ADCALC_POSITION                             0x4
#define _ADCON3_ADCALC_SIZE                                 0x3
#define _ADCON3_ADCALC_LENGTH                               0x3
#define _ADCON3_ADCALC_MASK                                 0x70
#define _ADCON3_ADTMD0_POSN                                 0x0
#define _ADCON3_ADTMD0_POSITION                             0x0
#define _ADCON3_ADTMD0_SIZE                                 0x1
#define _ADCON3_ADTMD0_LENGTH                               0x1
#define _ADCON3_ADTMD0_MASK                                 0x1
#define _ADCON3_ADTMD1_POSN                                 0x1
#define _ADCON3_ADTMD1_POSITION                             0x1
#define _ADCON3_ADTMD1_SIZE                                 0x1
#define _ADCON3_ADTMD1_LENGTH                               0x1
#define _ADCON3_ADTMD1_MASK                                 0x2
#define _ADCON3_ADTMD2_POSN                                 0x2
#define _ADCON3_ADTMD2_POSITION                             0x2
#define _ADCON3_ADTMD2_SIZE                                 0x1
#define _ADCON3_ADTMD2_LENGTH                               0x1
#define _ADCON3_ADTMD2_MASK                                 0x4
#define _ADCON3_ADCALC0_POSN                                0x4
#define _ADCON3_ADCALC0_POSITION                            0x4
#define _ADCON3_ADCALC0_SIZE                                0x1
#define _ADCON3_ADCALC0_LENGTH                              0x1
#define _ADCON3_ADCALC0_MASK                                0x10
#define _ADCON3_ADCALC1_POSN                                0x5
#define _ADCON3_ADCALC1_POSITION                            0x5
#define _ADCON3_ADCALC1_SIZE                                0x1
#define _ADCON3_ADCALC1_LENGTH                              0x1
#define _ADCON3_ADCALC1_MASK                                0x20
#define _ADCON3_ADCALC2_POSN                                0x6
#define _ADCON3_ADCALC2_POSITION                            0x6
#define _ADCON3_ADCALC2_SIZE                                0x1
#define _ADCON3_ADCALC2_LENGTH                              0x1
#define _ADCON3_ADCALC2_MASK                                0x40

// Register: ADACQ
#define ADACQ ADACQ
extern volatile unsigned char           ADACQ               __at(0xF57);
#ifndef _LIB_BUILD
asm("ADACQ equ 0F57h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADACQ                  :8;
    };
    struct {
        unsigned ADACQ0                 :1;
        unsigned ADACQ1                 :1;
        unsigned ADACQ2                 :1;
        unsigned ADACQ3                 :1;
        unsigned ADACQ4                 :1;
        unsigned ADACQ5                 :1;
        unsigned ADACQ6                 :1;
        unsigned ADACQ7                 :1;
    };
} ADACQbits_t;
extern volatile ADACQbits_t ADACQbits __at(0xF57);
// bitfield macros
#define _ADACQ_ADACQ_POSN                                   0x0
#define _ADACQ_ADACQ_POSITION                               0x0
#define _ADACQ_ADACQ_SIZE                                   0x8
#define _ADACQ_ADACQ_LENGTH                                 0x8
#define _ADACQ_ADACQ_MASK                                   0xFF
#define _ADACQ_ADACQ0_POSN                                  0x0
#define _ADACQ_ADACQ0_POSITION                              0x0
#define _ADACQ_ADACQ0_SIZE                                  0x1
#define _ADACQ_ADACQ0_LENGTH                                0x1
#define _ADACQ_ADACQ0_MASK                                  0x1
#define _ADACQ_ADACQ1_POSN                                  0x1
#define _ADACQ_ADACQ1_POSITION                              0x1
#define _ADACQ_ADACQ1_SIZE                                  0x1
#define _ADACQ_ADACQ1_LENGTH                                0x1
#define _ADACQ_ADACQ1_MASK                                  0x2
#define _ADACQ_ADACQ2_POSN                                  0x2
#define _ADACQ_ADACQ2_POSITION                              0x2
#define _ADACQ_ADACQ2_SIZE                                  0x1
#define _ADACQ_ADACQ2_LENGTH                                0x1
#define _ADACQ_ADACQ2_MASK                                  0x4
#define _ADACQ_ADACQ3_POSN                                  0x3
#define _ADACQ_ADACQ3_POSITION                              0x3
#define _ADACQ_ADACQ3_SIZE                                  0x1
#define _ADACQ_ADACQ3_LENGTH                                0x1
#define _ADACQ_ADACQ3_MASK                                  0x8
#define _ADACQ_ADACQ4_POSN                                  0x4
#define _ADACQ_ADACQ4_POSITION                              0x4
#define _ADACQ_ADACQ4_SIZE                                  0x1
#define _ADACQ_ADACQ4_LENGTH                                0x1
#define _ADACQ_ADACQ4_MASK                                  0x10
#define _ADACQ_ADACQ5_POSN                                  0x5
#define _ADACQ_ADACQ5_POSITION                              0x5
#define _ADACQ_ADACQ5_SIZE                                  0x1
#define _ADACQ_ADACQ5_LENGTH                                0x1
#define _ADACQ_ADACQ5_MASK                                  0x20
#define _ADACQ_ADACQ6_POSN                                  0x6
#define _ADACQ_ADACQ6_POSITION                              0x6
#define _ADACQ_ADACQ6_SIZE                                  0x1
#define _ADACQ_ADACQ6_LENGTH                                0x1
#define _ADACQ_ADACQ6_MASK                                  0x40
#define _ADACQ_ADACQ7_POSN                                  0x7
#define _ADACQ_ADACQ7_POSITION                              0x7
#define _ADACQ_ADACQ7_SIZE                                  0x1
#define _ADACQ_ADACQ7_LENGTH                                0x1
#define _ADACQ_ADACQ7_MASK                                  0x80

// Register: ADCAP
#define ADCAP ADCAP
extern volatile unsigned char           ADCAP               __at(0xF58);
#ifndef _LIB_BUILD
asm("ADCAP equ 0F58h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADCAP                  :5;
    };
    struct {
        unsigned ADCAP0                 :1;
        unsigned ADCAP1                 :1;
        unsigned ADCAP2                 :1;
        unsigned ADCAP3                 :1;
        unsigned ADCAP4                 :1;
    };
} ADCAPbits_t;
