MikroElektronika/core_packages/PIC/XC8/def/PIC18F47Q10/mcu.h
#define                                 ZCDIF_bit           _BIT_ACCESS(PIR2,6)
// ZCDCON<ZCDINTN>
extern volatile __bit                   ZCDINTN             __at(0x7968);	// @ (0xF2D * 8 + 0)
#define                                 ZCDINTN_bit         _BIT_ACCESS(ZCDCON,0)
// ZCDCON<ZCDINTP>
extern volatile __bit                   ZCDINTP             __at(0x7969);	// @ (0xF2D * 8 + 1)
#define                                 ZCDINTP_bit         _BIT_ACCESS(ZCDCON,1)
// IPR2<ZCDIP>
extern volatile __bit                   ZCDIP               __at(0x75BE);	// @ (0xEB7 * 8 + 6)
#define                                 ZCDIP_bit           _BIT_ACCESS(IPR2,6)
// PMD2<ZCDMD>
extern volatile __bit                   ZCDMD               __at(0x76F0);	// @ (0xEDE * 8 + 0)
#define                                 ZCDMD_bit           _BIT_ACCESS(PMD2,0)
// ZCDCON<ZCDOUT>
extern volatile __bit                   ZCDOUT              __at(0x796D);	// @ (0xF2D * 8 + 5)
#define                                 ZCDOUT_bit          _BIT_ACCESS(ZCDCON,5)
// ZCDCON<ZCDPOL>
extern volatile __bit                   ZCDPOL              __at(0x796C);	// @ (0xF2D * 8 + 4)
#define                                 ZCDPOL_bit          _BIT_ACCESS(ZCDCON,4)
// ZCDCON<ZCDSEN>
extern volatile __bit                   ZCDSEN              __at(0x796F);	// @ (0xF2D * 8 + 7)
#define                                 ZCDSEN_bit          _BIT_ACCESS(ZCDCON,7)
// SSP1STAT<nADDRESS1>
extern volatile __bit                   nADDRESS1           __at(0x7CA5);	// @ (0xF94 * 8 + 5)
#define                                 nADDRESS1_bit       _BIT_ACCESS(SSP1STAT,5)
// SSP2STAT<nADDRESS2>
extern volatile __bit                   nADDRESS2           __at(0x7485);	// @ (0xE90 * 8 + 5)
#define                                 nADDRESS2_bit       _BIT_ACCESS(SSP2STAT,5)
// PCON0<nBOR>
extern volatile __bit                   nBOR                __at(0x7EB8);	// @ (0xFD7 * 8 + 0)
#define                                 nBOR_bit            _BIT_ACCESS(PCON0,0)
// STATUS<nPD>
extern volatile __bit                   nPD                 __at(0x7EC5);	// @ (0xFD8 * 8 + 5)
#define                                 nPD_bit             _BIT_ACCESS(STATUS,5)
// PCON0<nPOR>
extern volatile __bit                   nPOR                __at(0x7EB9);	// @ (0xFD7 * 8 + 1)
#define                                 nPOR_bit            _BIT_ACCESS(PCON0,1)
// PCON1<nRCM>
extern volatile __bit                   nRCM                __at(0x7EB0);	// @ (0xFD6 * 8 + 0)
#define                                 nRCM_bit            _BIT_ACCESS(PCON1,0)
// PCON0<nRI>
extern volatile __bit                   nRI                 __at(0x7EBA);	// @ (0xFD7 * 8 + 2)
#define                                 nRI_bit             _BIT_ACCESS(PCON0,2)
// PCON0<nRMCLR>
extern volatile __bit                   nRMCLR              __at(0x7EBB);	// @ (0xFD7 * 8 + 3)
#define                                 nRMCLR_bit          _BIT_ACCESS(PCON0,3)
// PCON1<nRVREG>
extern volatile __bit                   nRVREG              __at(0x7EB2);	// @ (0xFD6 * 8 + 2)
#define                                 nRVREG_bit          _BIT_ACCESS(PCON1,2)
// PCON0<nRWDT>
extern volatile __bit                   nRWDT               __at(0x7EBC);	// @ (0xFD7 * 8 + 4)
#define                                 nRWDT_bit           _BIT_ACCESS(PCON0,4)
// T1CON<nT1SYNC>
extern volatile __bit                   nT1SYNC             __at(0x7E72);	// @ (0xFCE * 8 + 2)
#define                                 nT1SYNC_bit         _BIT_ACCESS(T1CON,2)
// T3CON<nT3SYNC>
extern volatile __bit                   nT3SYNC             __at(0x7E42);	// @ (0xFC8 * 8 + 2)
#define                                 nT3SYNC_bit         _BIT_ACCESS(T3CON,2)
// T5CON<nT5SYNC>
extern volatile __bit                   nT5SYNC             __at(0x7E12);	// @ (0xFC2 * 8 + 2)
#define                                 nT5SYNC_bit         _BIT_ACCESS(T5CON,2)
// STATUS<nTO>
extern volatile __bit                   nTO                 __at(0x7EC6);	// @ (0xFD8 * 8 + 6)
#define                                 nTO_bit             _BIT_ACCESS(STATUS,6)
// PCON0<nWDTWV>
extern volatile __bit                   nWDTWV              __at(0x7EBD);	// @ (0xFD7 * 8 + 5)
#define                                 nWDTWV_bit          _BIT_ACCESS(PCON0,5)
// SSP1STAT<nWRITE1>
extern volatile __bit                   nWRITE1             __at(0x7CA2);	// @ (0xF94 * 8 + 2)
#define                                 nWRITE1_bit         _BIT_ACCESS(SSP1STAT,2)
// SSP2STAT<nWRITE2>
extern volatile __bit                   nWRITE2             __at(0x7482);	// @ (0xE90 * 8 + 2)
#define                                 nWRITE2_bit         _BIT_ACCESS(SSP2STAT,2)

#endif // _PIC18F47Q10_H_
